In [101]:
# sales data importing
import numpy as np
import pandas as pd
sale=pd.read_excel('1 Sales Data (1).xlsx')
sale.head()

,Invoice Number,Date,Time,Zone,Manager,Customer,Product,price,Units Sold,sales
0,102234,2010-01-07,10:25:37.200000,East,Bruce,Polo,A001,485,42,20370
1,102235,2010-01-07,12:00:00,East,Jacob,EEE,B227,292,71,20732
2,102235,2010-01-07,14:19:12,East,Melvin,Marco,A009,544,87,47328
3,102236,2010-01-07,12:57:00,South,Alicia,EEE,D440,385,51,19635
4,102236,2010-01-07,14:51:36,East,Paul,Zee,WP6,173,69,11937

In [102]:
sale.tail()

,Invoice Number,Date,Time,Zone,Manager,Customer,Product,price,Units Sold,sales
26078,115273,2018-12-10,11:16:48,West,Melvin,ABC,B229,388,202,78376
26079,115274,2018-12-10,11:16:48,West,Melvin,ABC,B229,388,201,77988
26080,115273,2019-12-10,11:16:48,West,Melvin,ABC,B229,388,500,194000
26081,115273,2019-12-10,11:16:48,West,Melvin,ABC,B229,388,1000,388000
26082,115274,2019-12-10,11:16:48,West,Melvin,ABC,B229,388,1500,582000

### Check is there any null values in the data. Yes/ No

In [103]:
sale.isnull().any()

Invoice Number    False
Date              False
Time              False
Zone              False
Manager           False
Customer          False
Product           False
price             False
Units Sold        False
sales             False
dtype: bool

### Find total sales.

In [104]:
a=sale['sales'].sum()
a

1085806200

### Find total number of products sold.

In [105]:
b=sale['Product '].value_counts().sum()
b

26083

### Find maximum Sales

In [106]:
c=sale['sales'].max()
c

582000

### Find Minimum Sales

In [107]:
d=sale['sales'].min()
d

865

### Find the Average Sales

In [108]:
e=sale['sales'].mean()
e

41628.88471418165

### Find the Range of Sales

In [109]:
# Range= max-min
f=582000-865
f

581135

### Find the Standard Deviation of Sales

In [115]:
print("standard dev:",np.std(sales))

standard dev: Invoice Number                    3764.756508
Date              941 days 06:39:14.174732496
price                              117.085079
Units Sold                           71.19162
sales                             30413.15122
dtype: object

C:\Users\jiyam\anaconda3\lib\site-packages\numpy\core\fromnumeric.py:3571: FutureWarning: The default value of numeric_only in DataFrame.std is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  return std(axis=axis, dtype=dtype, out=out, ddof=ddof, **kwargs)

### Find Average Sales by each zone

In [14]:
sale['sales','Zone'].mean()

NameError: name 'sale' is not defined

### Find maximum sales by each zone

In [13]:
k=sale['sales'].max()
k

NameError: name 'sale' is not defined

### Find minimum sales by each zone

### Give an Inference from the data